# DATA GROUPING
---

The table below shows the number of visits to a certain online store and the number of products purchased.

Day | Browser | Visits | Purchase
----|---------|--------|---------
Monday | Edge | 15 | 3
Monday | Chrome | 17 | 1
Monday | Safari | 11 | 2
Friday | Edge | 10 | 2
Friday | Safari | 23 | 7
Sunday | Chrome | 34 | 12

In [1]:
import pandas as pd
visits_data = {
    'Day':['Monday','Monday','Monday','Friday','Friday','Sunday'],
    'Browser':['Edge','Chrome','Safari','Edge','Safari','Chrome'],
    'Visits':[15,17,11,10,23,34],
    'Purchase':[3,1,2,2,7,12]
    }
visits = pd.DataFrame(visits_data)
visits

      Day Browser  Visits  Purchase
0  Monday    Edge      15         3
1  Monday  Chrome      17         1
2  Monday  Safari      11         2
3  Friday    Edge      10         2
4  Friday  Safari      23         7
5  Sunday  Chrome      34        12

To calculate and display the total number of visits on individual days of the week, specify the result columns, the columns by which the data are grouped and the aggregation function:

In [2]:
visits.loc[:,['Day','Visits']].groupby(['Day']).sum()

        Visits
Day
Friday      33
Monday      43
Sunday      34

If you also want to calculate the total of products purchased for each week, add the column name 'Purchase' to the list of result columns.

In [3]:
visits.loc[:,['Day','Visits','Purchase']].groupby(['Day']).sum()

        Visits  Purchase
Day
Friday      33         9
Monday      43         6
Sunday      34        12

### Tasks

Calculate and display the average number of website visits by day of the week, depending on the web browser.

In [16]:
visits.loc[:, ['Day','Browser', 'Visits']].groupby(['Browser', 'Day']).mean()

                Visits
Browser Day
Chrome  Monday    17.0
        Sunday    34.0
Edge    Friday    10.0
        Monday    15.0
Safari  Friday    23.0
        Monday    11.0

Calculate and display the number of web browsers used on specific days of the week.

In [28]:
visits.loc[:, ['Day', 'Browser']].groupby(['Day']).count()

        Browser
Day
Friday        2
Monday        3
Sunday        1

Calculate and display the number of web browsers used on specific days of the week. Sort the results in descending order.

In [31]:
visits.loc[:, ['Day', 'Browser']].groupby(['Day']).count().sort_values(by='Browser', ascending=False)

        Browser
Day
Monday        3
Friday        2
Sunday        1

The 'employees.csv' file contains data of employees of one of the IT companies. Display employee list. Then, calculate and display:

1. Number of women and men
1. Number of employees by country
1. Number of women and men by country
1. Average age of employees
1. Average age of women and men
1. Average salary in the company.
1. Average salary of women and men
1. Minimum age of women and men by country. Sort the results in descending order.
1. Median salary of women and men by country.
1. Median salary of women and men by country. Save the results to a csv file.

In [ ]:
employees = pd.read_csv('employees.csv')
employees

In [38]:
employees['sex'].value_counts()

sex
Male      13
Female     7
Name: count, dtype: int64

In [39]:
employees['country'].value_counts()

country
Czech Republic    11
Poland             8
United Kingdom     1
Name: count, dtype: int64

In [46]:
employees.loc[:, ['sex', 'country']].groupby(['country']).value_counts()

country         sex
Czech Republic  Male      8
                Female    3
Poland          Female    4
                Male      4
United Kingdom  Male      1
Name: count, dtype: int64

In [47]:
employees['age'].mean()

45.15

In [52]:
employees.loc[:, ['sex', 'age']].groupby(['sex']).mean()

              age
sex
Female  38.428571
Male    48.769231

In [53]:
employees['salary'].mean()

73804.416

In [54]:
employees.loc[:, ['sex', 'salary']].groupby(['sex']).mean()

              salary
sex
Female  82115.781429
Male    69329.065385

In [57]:
#Minimum age of women and men by country. Sort the results in descending order.
employees.loc[:, ['sex', 'country', 'age']].groupby(['country', 'sex']).min()

                       age
country        sex
Czech Republic Female   20
               Male     35
Poland         Female   19
               Male     47
United Kingdom Male     37

In [58]:
#Median salary of women and men by country.
employees.loc[:, ['sex','country', 'salary']].groupby(['country', 'sex']).median()

                           salary
country        sex
Czech Republic Female   44973.700
               Male     57259.410
Poland         Female  107833.315
               Male     72688.560
United Kingdom Male    148308.960

In [59]:
#Median salary of women and men by country. Save the results to a csv file.
e = employees.loc[:, ['sex','country', 'salary']].groupby(['country', 'sex']).median()
e.to_csv('median_salary.csv')